#!/bin/sh#
# Requires manual configuration you run the "brew bundle"
#
# after run the "brew 'bundle":
#   gnu-tar
#     $ cd /usr/bin
#     $ sudo rm tar
#     $ sudo ln -s /usr/local/bin/gtar tar
#
#   zsh
#     $ sudo vi /etc/shells
#     /usr/local/bin/zsh # add last line
#     $ chsh -s /usr/local/bin/zsh
#

# tap
# for brew bundle
tap 'homebrew/bundle'
# for brew versions
tap 'homebrew/versions'
# for ghq
tap 'motemen/ghq'
# for gitsh
tap 'thoughtbot/formulae'
# for tuntap
tap 'caskroom/cask'
# for xpdf
tap 'homebrew/x11'
# for tmux21
tap 'nalabjp/formula'

# ag
brew 'the_silver_searcher'
# colordiff
brew 'colordiff'
# cmake
brew 'cmake'
# coreutils
brew 'coreutils'
# ctags
brew 'ctags'
# direnv
brew 'direnv'
# emojify
brew 'emojify'
# findutils
brew 'findutils'
# fontforge
brew 'fontforge'
# ffmpeg
brew 'ffmpeg'
# ghq
brew 'ghq'
# git
brew 'git'
brew 'hub'
brew 'tig'
brew 'gitsh'
# gnu-sed
brew 'gnu-sed'
# gnu-tar
brew 'gnu-tar', args: ['with-default-names']
# go
brew 'go'
brew 'glide'
# heroku
brew 'heroku'
# htop
brew 'htop'
# httpie
brew 'httpie'
# imagemagick
brew 'imagemagick'
# iterm2 v3
cask 'Caskroom/versions/iterm2-beta'
# jq
brew 'jq'
# libxml2
brew 'libxml2'
# libxslt
brew 'libxslt'
# lua
brew 'lua'
# macvim
brew 'macvim', args: ['with-lua', 'override-system-vim']
# mecab
brew 'mecab'
brew 'mecab-ipadic'
# mongodb
brew 'mongodb'
# mysql
brew 'mysql'
# nginx
brew 'nginx'
# nkf
brew 'nkf'
# nodebrew
brew 'nodebrew'
# openvpn
cask 'tuntap'
brew 'openvpn'
# pandoc
brew 'pandoc'
# phantomjs
brew 'phantomjs'
# postgresql
brew 'postgresql'
# pstree
brew 'pstree'
# pup
brew 'pup'
# pwgen
brew 'pwgen'
# ranger
brew 'ranger'
brew 'lynx'
brew 'atool'
brew 'mediainfo'
brew 'highlight'
brew 'w3m'
brew 'elinks'
brew 'poppler'
brew 'transmission'
brew 'exiftool'
brew 'xpdf'     # require xquartz in Brewfile_sudo
brew 'libcaca'  # require xquartz in Brewfile_sudo
brew 'imlib2'   # require xquartz in Brewfile_sudo
# redis
brew 'redis'
# rename
brew 'rename'
# ruby
brew 'openssl'
brew 'readline'
brew 'rbenv'
brew 'ruby-build'
brew 'rsense'
# rbenv-default-gems
brew 'rbenv-default-gems'
# source-highlight
brew 'source-highlight'
# sqlite
brew 'sqlite'
# tmux
brew 'reattach-to-user-namespace'
brew 'tmux21'
# tree
brew 'tree'
# watch
brew 'watch'
# wget
brew 'wget'
# zplug
brew 'zplug'
# zsh
brew 'zsh', args: ['without-etcdir']
