#!/bin/sh#
# Requires manual configuration you run the "brew bundle"
#
# after run the "brew 'bundle":
#   gnu-tar
#     $ cd /usr/bin
#     $ sudo rm tar
#     $ sudo ln -s /usr/local/bin/gtar tar
#
#   zsh
#     $ sudo vi /etc/shells
#     /usr/local/bin/zsh # add last line
#     $ chsh -s /usr/local/bin/zsh
#

# tap
# for brew bundle
tap 'homebrew/bundle'
# for ergodox
tap 'osx-cross/avr'
# for gitsh
tap 'thoughtbot/formulae'
# for itemr2, chromedriver
tap 'homebrew/cask-cask'
# neovim
tap 'neovim/neovim'

# python3
brew 'python3'
# ag
brew 'the_silver_searcher'
# chromedriver
brew 'chromedriver'
# colordiff
brew 'colordiff'
# cmake
brew 'cmake'
# coreutils
brew 'coreutils'
# direnv
brew 'direnv'
# emojify
brew 'emojify'
# ergodox
brew 'teensy_loader_cli'
brew 'avr-gcc'
brew 'dfu-programmer'
# findutils
brew 'findutils'
# fontforge
brew 'fontforge'
# ffmpeg
brew 'ffmpeg'
# ghq
brew 'ghq'
# git
brew 'git'
brew 'hub'
brew 'tig'
brew 'gist'
brew 'git-now', args: ['zsh-completion']
# gnu-sed
brew 'gnu-sed'
# gnu-tar
brew 'gnu-tar'
# go
brew 'go'
brew 'glide'
# heroku
brew 'heroku'
brew 'heroku/brew/heroku'
# htop
brew 'htop'
# httpie
brew 'httpie'
# imagemagick
brew 'imagemagick'
# iterm2 v3
cask 'iterm2'
# jq
brew 'jq'
# libxml2
brew 'libxml2'
# libxslt
brew 'libxslt'
# lua
brew 'lua'
# mecab
brew 'mecab'
brew 'mecab-ipadic'
# mongodb
brew 'mongodb'
# mysql5.7
brew 'mysql@5.7'
# neovim
brew 'neovim/neovim/neovim'
# nginx
brew 'nginx'
brew 'openssl@1.1'
# nkf
brew 'nkf'
# nodebrew
brew 'nodebrew'
# noti
brew 'noti'
# openvpn
brew 'openvpn'
# pandoc
brew 'pandoc'
# phantomjs
brew 'phantomjs'
# postgresql
brew 'postgresql'
# pstree
brew 'pstree'
# pup
brew 'pup'
# pt(the_platinum_searcher)
brew 'pt'
# pwgen
brew 'pwgen'
# redis
brew 'redis'
# rename
brew 'rename'
# ruby
brew 'openssl'
brew 'readline'
brew 'rbenv'
brew 'ruby-build'
# rbenv-default-gems
brew 'rbenv-default-gems'
# source-highlight
brew 'source-highlight'
# sqlite
brew 'sqlite'
# tmux
brew 'tmux'
# tree
brew 'tree'
# watch
brew 'watch'
# wget
brew 'wget'
# yarn
brew 'yarn'
# zplug
brew 'zplug'
# zsh
brew 'zsh', args: ['without-etcdir']
